import os
Task = 0
List1 = ['1. Сумма нечетных позиций списка.','2. Произведение пар чисел списка.','3. Разница между min и max дробной частью.','4. Десятичное число в двоичное.','5. Фибоначчи.','6. Выход']
os.system('cls')

def enter_key_to_continue():
    input("\033[0m{}".format('=================================================\nДля продолжения нажмите клавишу [ENTER]'))
    main()
def error(x):
    os.system('cls')
    print("\033[37m\033[41m{}".format('\n                                       '
                              '\n              ОШИБКА!!!                '
                              '\n  Вы ввели не существующую команду...  '
                              '\n      Выберите команду из списка.      '
                              '\n                                       '))
    enter_key_to_continue()

# ========================= ДОМАШНЕЕ ЗАДАНИЕ ===========================

def Task01():
    print("\033[36m{}".format('Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.'
                              '\n*Пример:*'
                              '\n- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12'))
    num = int(input('Укажите размер списка ->  '))
    List01 = []
    result = 0
    for i in range(num):
        List01.insert(i, i+1)
        if i%2 !=0:
            result = result + List01[i]
    print("\033[32m{}".format(f'=================================================\n{List01}\n'
                              f'Сумма нечетных позиций равна: {result}\n=================================================\n'))
def Task02():
    print("\033[36m{}".format('Task 2 text'))
    print("\033[32m{}".format('=================================================\nresult\n=================================================\n'))
def Task03():
    print("\033[36m{}".format('Task 3 text'))
    print("\033[32m{}".format('=================================================\nresult\n=================================================\n'))
def Task04():
    print("\033[36m{}".format('Task 4 text'))
    print("\033[32m{}".format('=================================================\nresult\n=================================================\n'))
def Task05():
    print("\033[36m{}".format('Task 5 text'))
    print("\033[32m{}".format('=================================================\nresult\n=================================================\n'))

# ======================================================================

def choice(x):
    os.system('cls')
    if x <= len(List1):
        print("\033[33m{}".format(f'=================================================\n{List1[x-1]}\n================================================='))
    if x == 1:
        Task01()
        enter_key_to_continue()
    elif x == 2:
        Task02()
        enter_key_to_continue()
    elif x == 3:
        Task03()
        enter_key_to_continue()
    elif x == 4:
        Task04()
        enter_key_to_continue()
    elif x == 5:
        Task05()
        enter_key_to_continue()
    elif x == 6:
        os.system('cls')
        print("\033[0m{}".format('Выход из программы...'))
        import sys
        sys.exit()
    else:
        error(Task)
def main():
    os.system('cls')
    print("\033[32m{}".format('================================================\n============ Г Л А В Н О Е  М Е Н Ю ============\n================================================'))
    print("\033[33m{}".format('Выберите действие...'))
    print(*List1, sep='\n')
    print("\033[32m{}".format('================================================'))
    try:
        Task = int(input("\033[0m{}".format('Введите номер операции ->  ')))
    except:
        Task = 0
    choice(Task)

main()